src/cf/Documents/уатНачислениеУдержаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатНачислениеУдержаний</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.уатУдержания</xr:Item>
				<xr:Item>AccumulationRegister.уатДоходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма удержаний в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МотивУдержания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУдержания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Удержания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТарифыЗП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удержание</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.уатУдержания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатШтраф</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/уатНачислениеУдержаний/Forms/ЗаполнениеПоШтрафам/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		АвтоТест = Истина;
		Возврат;
	КонецЕсли;
	
	флСозданиеУдержанийИзФормыСписка = Параметры.Свойство("ИзФормыСписка");
	
	НастроитьКомпоновщикОтбора();
	
	Если флСозданиеУдержанийИзФормыСписка ИЛИ НЕ Параметры.Свойство("ПериодНачисления") Тогда
		НачалоПериода = НачалоМесяца(ТекущаяДата());
		КонецПериода  = КонецМесяца(ТекущаяДата());
	Иначе
		НачалоПериода = НачалоМесяца(Параметры.ПериодНачисления);
		КонецПериода  = КонецМесяца(Параметры.ПериодНачисления);
		
		Для Каждого ТекОтбор Из КомпоновщикНастроекОтбора.Настройки.Отбор.Элементы Цикл
			Если ТекОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация") Тогда
				ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ТекОтбор.ПравоеЗначение = Параметры.Организация;
				ТекОтбор.Использование  = Истина;
			ИначеЕсли ТекОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Водитель") Тогда
				ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ТекОтбор.ПравоеЗначение = Параметры.Сотрудник;
				ТекОтбор.Использование  = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Элементы.ПереключательДействие.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Автотест Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СохранитьОтборКомпоновки();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаПериода(Команда)
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериода.Период.ДатаНачала    = НачалоПериода;
	ДиалогПериода.Период.ДатаОкончания = КонецПериода;
	ДиалогПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		НачалоПериода = Период.ДатаНачала;
		КонецПериода  = Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьШтрафами(Команда)
	мсвШтрафы = ПолучитьШтрафыДляЗаполненияУдержаний();
	Закрыть(Новый Структура("Штрафы, Действие, ПериодНачисления",
		мсвШтрафы, ПереключательДействие, КонецПериода));
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиПоУмолчанию(Команда)
	НастроитьКомпоновщикОтбора(Истина);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьКомпоновщикОтбора(ПоУмолчанию = Ложь)
	СхемаКомпоновкиДанных = Документы.уатНачислениеУдержаний.ПолучитьМакет("НастройкиЗаполненияПоШтрафам");
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	КомпоновщикНастроекОтбора.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	КомпоновщикНастроекОтбора.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

	Если НЕ ПоУмолчанию Тогда
		ВосстановитьОтборКомпоновки();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВосстановитьОтборКомпоновки()
	СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить(
		"Документ.уатНачислениеУдержаний.Форма.ЗаполнениеПоШтрафам",
		"ЗаполнениеУдержанийПоШтрафам_Настройки" + ?(флСозданиеУдержанийИзФормыСписка, "_ИзФормыСписка", ""));
	
	Если СтруктураНастроек <> Неопределено
		И ТипЗнч(СтруктураНастроек) = Тип("НастройкиКомпоновкиДанных") Тогда
		КомпоновщикНастроекОтбора.ЗагрузитьНастройки(СтруктураНастроек);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьОтборКомпоновки()
	ХранилищеНастроекДанныхФорм.Сохранить(
		"Документ.уатНачислениеУдержаний.Форма.ЗаполнениеПоШтрафам", 
		"ЗаполнениеУдержанийПоШтрафам_Настройки" + ?(флСозданиеУдержанийИзФормыСписка, "_ИзФормыСписка", ""),
		КомпоновщикНастроекОтбора.Настройки);
КонецПроцедуры

&НаСервере
Функция ПолучитьШтрафыДляЗаполненияУдержаний()
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных),
		КомпоновщикНастроекОтбора.ПолучитьНастройки(),
		,
		,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПараметрКомпоновкиДанных = МакетКомпоновки.ЗначенияПараметров.Добавить();
	ПараметрКомпоновкиДанных.Имя      = "ДатаНач";
	ПараметрКомпоновкиДанных.Значение = НачалоПериода;
	ПараметрКомпоновкиДанных = МакетКомпоновки.ЗначенияПараметров.Добавить();
	ПараметрКомпоновкиДанных.Имя      = "ДатаКон";
	ПараметрКомпоновкиДанных.Значение = КонецДня(КонецПериода);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	тблШтрафы = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(тблШтрафы);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	мсвШтрафы = Новый Массив;
	Для Каждого ТекСтрока Из тблШтрафы Цикл
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Организация", ТекСтрока.Организация);
		СтруктураСтроки.Вставить("Сотрудник",   ТекСтрока.Водитель);
		СтруктураСтроки.Вставить("ТС",          ТекСтрока.ТС);
		СтруктураСтроки.Вставить("Удержание",   ПланыВидовРасчета.уатУдержания.Штраф);
		СтруктураСтроки.Вставить("Сумма",       ТекСтрока.СуммаШтрафа);
		СтруктураСтроки.Вставить("Основание",   ТекСтрока.Ссылка);
		СтруктураСтроки.Вставить("Комментарий", "" + ТекСтрока.Ссылка + ", УИН " + ТекСтрока.НомерПостановления);
		мсвШтрафы.Добавить(СтруктураСтроки);
	КонецЦикла;
		
	Возврат мсвШтрафы;
	
КонецФункции

#КонецОбласти
